app/controllers/room_messages_controller.rb

def create
  @room_message = RoomMessage.create user: current_user,
                                     room: @room,
                                     message: params.dig(:room_message, :message)
---
INSERT INTO "room_messages" ("room_id", "user_id", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["room_id", 1], ["user_id", 1], ["message", "qwe"], ["created_at", "2021-07-29 12:07:28.424628"], ["updated_at", "2021-07-29 12:07:28.424628"]]

  def load_entities
    @room = Room.find params.dig(:room_message, :room_id)
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]