app/controllers/rooms_controller.rb

SELECT "room_messages".* FROM "room_messages" WHERE "room_messages"."room_id" = ?  [["room_id", 1]]
SELECT "rooms".* FROM "rooms"
---
  def show
    @room_message = RoomMessage.new room: @room
    @room_messages = @room.room_messages.includes(:user)

SELECT "rooms".* FROM "rooms"
---
  def index
    @rooms = Room.all

INSERT INTO "rooms" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "123"], ["created_at", "2021-07-29 11:25:25.362364"], ["updated_at", "2021-07-29 11:25:25.362364"]]
---
  def create
    @room = Room.new permitted_parameters

    if @room.save

SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def load_entities
    @rooms = Room.all
    @room = Room.find(params[:id]) if params[:id]